CREATE VIEW "PINAKAS_POLITON_ME_KOINA_STOIXEIA" AS

SELECT "Π"."ΚωδικόςΠολίτη","Ε"."ΚωδικόςΚαταστήματος",
"Ε"."ΗμερομηνίαΕισόδου","Ε"."ΛεπτόΕισόδου","Ε"."ΔιάρκειαΠαραμονής",
"Π"."ΚωδικόςΚατοικίας","Π"."ΚωδικόςΕργασίας"     
FROM "ΠΟΛΙΤΗΣ"  AS "Π" INNER JOIN "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ" AS "Ε"
ON "Π"."ΚωδικόςΠολίτη"="Ε"."ΚωδικόςΠολίτη";

SELECT  DISTINCT "C1"."ΚωδικόςΠολίτη" AS "ΚωδικόςΠολίτη1","C2"."ΚωδικόςΠολίτη" 

AS "ΚωδικόςΠολίτη2","C1"."ΚωδικόςΚατοικίας","C1"."ΚωδικόςΕργασίας", 

"C1"."ΚωδικόςΚαταστήματος" 

FROM "PINAKAS_POLITON_ME_KOINA_STOIXEIA" AS "C1" 

CROSS JOIN  "PINAKAS_POLITON_ME_KOINA_STOIXEIA" AS "C2" 



WHERE  "C1"."ΚωδικόςΠολίτη"<> "C2"."ΚωδικόςΠολίτη" 

AND "C1"."ΚωδικόςΕργασίας" = "C2"."ΚωδικόςΕργασίας" 

AND "C1"."ΚωδικόςΚατοικίας"="C2"."ΚωδικόςΚατοικίας" 

AND "C1"."ΚωδικόςΚαταστήματος"="C2"."ΚωδικόςΚαταστήματος" 

AND "C1"."ΗμερομηνίαΕισόδου"  BETWEEN 18 AND 30

AND "C2"."ΗμερομηνίαΕισόδου" BETWEEN 18 AND 30

GROUP BY "C1"."ΚωδικόςΚαταστήματος"

ORDER BY "C1"."ΚωδικόςΠολίτη" ASC;