CREATE VIEW "EPISKEPSIS_SE_KATASTIMATA" AS

SELECT "Ημερομηνία" 
FROM "ΧΡΟΝΟΣΦΡΑΓΙΔΑ"
WHERE "Ημερομηνία" BETWEEN
      (SELECT max("Ημερομηνία")FROM "ΧΡΟΝΟΣΦΡΑΓΙΔΑ") 
     AND (SELECT max("Ημερομηνία")FROM "ΧΡΟΝΟΣΦΡΑΓΙΔΑ") ;
 

SELECT "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ"."ΚωδικόςΚαταστήματος","Τύπος"
FROM    "ΚΑΤΑΣΤΗΜΑ"
INNER JOIN "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ" 
ON "ΚΑΤΑΣΤΗΜΑ"."ΚωδικόςΚαταστήματος"="ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ"."ΚωδικόςΚαταστήματος"
INNER JOIN  "ΠΟΛΙΤΗΣ" 
ON "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ"."ΚωδικόςΠολίτη"="ΠΟΛΙΤΗΣ"."ΚωδικόςΠολίτη"
WHERE "ΗμερομηνίαΕισόδου" BETWEEN 24 AND 30
GROUP BY "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ"."ΚωδικόςΚαταστήματος";