CREATE TABLE "ΧΡΟΝΟΣΦΡΑΓΙΔΑ2" (
"Ημερομηνία" INTEGER NOT NULL CHECK("Ημερομηνία">= 0),
"Λεπτό" INTEGER NOT NULL CHECK("Λεπτό"BETWEEN 0 AND 778),
PRIMARY KEY("Ημερομηνία", "Λεπτό")
);
UPDATE "ΧΡΟΝΟΣΦΡΑΓΙΔΑ2"
SET "Ημερομηνία"="Ημερομηνία"-1;
INSERT INTO "ΧΡΟΝΟΣΦΡΑΓΙΔΑ2"
SELECT "Ημερομηνία","Λεπτό"
FROM "ΧΡΟΝΟΣΦΡΑΓΙΔΑ";
INSERT INTO "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ2"
SELECT
"ΚωδικόςΠολίτη","ΚωδικόςΚαταστήματος","ΗμερομηνίαΕισόδου","ΛεπτόΕι
σόδου","ΔιάρκειαΠαραμονής"
FROM "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ;
ALTER TABLE "ΧΡΟΝΟΣΦΡΑΓΙΔΑ2"
RENAME TO "ΧΡΟΝΟΣΦΡΑΓΙΔΑ";
ALTER TABLE "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ2"
RENAME TO "ΕΠΙΣΚΕΨΗΠΟΛΙΤΗ";